#ifndef GRAPHS
#define GRAPH

#include <iostream>
#include <queue>
#include <stack>
#include <string.h>
#include <vector>

#define INF 101

using namespace std;

// Контейнер ребра
struct Edge
{   
    public:
        int begin;
        int end;
        int weight;
        Edge(int newBegin = int(), int newEnd = int(), int newWeigth = int())
        {   
            begin = newBegin;
            end = newEnd;
            weight = newWeigth;
        }
};

class Graph
{
    private:
        int uni;
        int countVertex; // количество 
        int countPath; // Количество путей в графе
        int** PM; // Матрица путей
        int** AM; // Матрица смежности
        int** IM; // Матрица инциденций
        queue <Edge> edge; // Список ребер
    public:    
        Graph(); // Констркутор
        ~Graph(); // Деструктор 
        void FromRLtoPM(); // Задание матрицы путей из списка ребер
        void PrintPM(); // Вывод матрицы путей
        void FromRLtoAM(); // Задание матрицы смежности из списка ребер
        void PrintAM(); // Вывод матрицы смежности
        void FromRLtoIM(); // Задание матрицы инциденций из списка ребер
        void PrintIM(); // Вывод матрицы инциденций
        void PrintLL(); // Вывод списка смежности
        void PrintRL(); // Вывод списка граней
        void InputRL(); // Ввод списка граней
        void InputVertexPath(); // Ввод вершин и ребер
        void Floyd(); // Алгоритм Флойда-Уоршелла
        void Prim_Kruskal(); // Алгоритм Прима/Крускала
        void Depth(); // Итеративный проход в глубину
        void Width(); // Итеративный проход в ширину
        void Dijkstra(); // Алгоритм дейкстры
        void traverse(int uni, bool vsisted[]);
        bool isConnected();
        int isEulerian();
        void Euler(); // Проверки по Эйлеру
        void MinimalPath(); // Нахождение кратчайшего простого пути
};

#endif

// __________________________________________________
// ___________________¶¶¶¶¶¶¶¶¶¶¶¶¶__________________
// ______________¶¶¶¶¶¶________¶¶¶¶¶¶¶_______________
// ____________¶¶¶¶__________________¶¶¶¶____________
// __________¶¶¶________________________¶¶¶__________
// _________¶¶____________________________¶¶¶________
// _______¶¶¶_______________________________¶¶_______
// ______¶¶__________________________________¶¶______
// _____¶¶_____________________________________¶_____
// ____¶¶______________________________________¶¶____
// ___¶¶_______________________________¶________¶¶___
// ___¶¶_____________________________¶¶¶¶¶¶¶_____¶¶__
// ___¶¶____________________________¶¶_____¶¶_____¶__
// ___¶¶____________________________________¶¶____¶¶_
// ___¶¶¶¶__________________________________¶_____¶¶_
// ___¶¶¶¶¶¶________________________¶¶¶¶¶¶¶_¶¶_____¶_
// __¶¶_____¶_________________¶¶____¶¶____¶_¶______¶_
// _¶¶______________________________¶______________¶_
// _¶¶___¶¶¶¶¶_____________¶¶_____¶¶¶¶¶¶___________¶_
// __¶¶_¶__¶¶¶¶¶_____¶__¶¶¶____¶¶¶_____¶__¶¶_______¶_
// ___¶¶___¶___¶¶¶____¶¶¶____¶¶¶_______¶_¶¶_______¶¶_
// _____¶¶¶¶¶____¶¶¶__¶¶¶¶_¶¶¶_________¶_¶¶_______¶__
// _______¶¶¶_______¶¶¶__¶¶____________¶_¶¶______¶¶__
// _______¶¶_¶______¶¶__¶_¶__________¶¶___¶_____¶¶___
// _______¶¶___¶¶¶¶¶_¶__¶_¶¶¶¶_____¶¶¶____¶¶¶¶¶¶¶¶___
// ______¶¶__________¶¶¶¶¶___¶¶¶¶_¶¶____________¶¶___
// ______¶________¶_¶¶__¶¶¶¶¶________________¶¶¶¶____
// ______¶¶______¶¶¶______¶¶_¶¶____________¶¶¶¶______
// _______¶¶______¶__________¶___________¶¶¶_¶_______
// ________¶¶¶_¶¶¶________________¶____¶¶¶___¶_______
// _________¶¶¶__¶¶_____________¶¶¶¶¶¶¶¶_____¶_______
// ___________¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶____¶¶______¶¶______
// ___________¶__¶_¶¶_¶¶¶_¶¶¶_¶¶¶____¶_______¶_______
// ___________¶¶_¶¶___¶_¶_¶_¶_¶__¶___¶______¶¶_______
// ____________¶¶_¶_¶¶¶__¶_¶¶¶_¶_¶__¶_____¶¶¶________
// _____________¶__¶¶_¶__¶_¶_¶_¶¶¶¶¶_____¶¶__________
// ______________¶__¶_¶¶_¶_¶¶¶¶¶__¶¶____¶¶___________
// ______________¶¶____________________¶_____________
// _______________¶¶__________________¶______________
// _______________¶¶_________________¶_______________
// _______________¶¶________________¶________________
// ________________¶_______________¶_________________
// ________________¶¶¶____________¶__________________
// _________________¶¶¶¶¶¶¶¶¶__¶¶¶¶__________________
// __________________________¶¶______________________